## Plan Result (prod_landing - TerraformPlanApply)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_database.this["MetadataControl"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
      ~ auto_pause_delay_in_minutes                                = 0 -> -1
        id                                                         = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-prod/databases/MetadataControl"
        name                                                       = "MetadataControl"
        tags                                                       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-services"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-prod"
        name                                          = "ingest00-services-prod"
      ~ service_endpoints                             = [
          + "Microsoft.CognitiveServices",
        ]
        # (7 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":88,"Program":"tfcmt","SHA1":"","Target":"prod_landing - TerraformPlanApply","Vars":{}} -->